### 개요

##### 1. 시작씬

- 시작하기
  
- 새로하기
  
#####  2. 로비씬

- 육각형 InGame버튼 배치하고 저장하기
  
- InGame으로 씬 전환하기

##### 3. 농장씬

- 포인트 저장하고 갱신하기
  
- 3D 캐릭터 움직임
  
- 농부 애니메이션 넣기
  
##### 4. 집안씬

- 밥먹고 포인트 소모하기



## 1. 시작씬
![2023-11-28-18-27-59 00_00_22_20 스틸-001](https://github.com/kjhjeonghyeon/SunMoon/assets/80999210/e140c8d5-e674-4a3e-98e4-da3cc780c1df)

시작하기를 누르면 저장된 데이터를 가지고 이어서 게임을 합니다

새하기를 누르면 저장된 데이터가 초기화됩니다
  
##  2. 로비씬

  ![2023-11-28-18-27-59 00_01_11_11 스틸-003](https://github.com/kjhjeonghyeon/SunMoon/assets/80999210/5811f541-35c7-4637-8517-7a68cb4ab93f)

육각형 InGame버튼 사서 배치할수있으며 배치를 저장할수있습니 

![2023-11-28-18-27-59 00_01_34_01 스틸-004](https://github.com/kjhjeonghyeon/SunMoon/assets/80999210/6a9b42a1-05a8-4571-83b1-a0153a75c463)

-더블클릭으 InGame으로 씬으로 들어갈수 있습니다

## 3. 농장씬

  ![2023-11-28-18-27-59 00_02_17_03 스틸-005](https://github.com/kjhjeonghyeon/SunMoon/assets/80999210/52694f72-965d-49ea-a2d1-4e5310c732ce)

- 농작아이템을 살수있으며 사서 심으면 포인트가 올라갑니다

  ![Snipaste_2023-12-15_21-52-07](https://github.com/kjhjeonghyeon/SunMoon/assets/80999210/f8b7d67d-b6df-48d6-b608-d26027bb7199)

- 고정된 시점으로  캐릭터를 움직일수있으며 심기 애니메이션이 가능합니다
  
## 4. 집안씬

![2023-11-28-18-27-59 00_03_01_10 스틸-007](https://github.com/kjhjeonghyeon/SunMoon/assets/80999210/2643bef8-d145-463f-b802-2eeaefaadd8a)

- 의식주를 해결하면서 포인트를 소모하고 코인을 획득합니



